In [1]:
# Load and activate the SQL extension to allow us to execute SQL in a Jupyter notebook.
%load_ext sql

In [2]:
# Load the Chinook database stored in your local machine. 
# Make sure the file is saved in the same folder as this notebook.
%sql sqlite:///chinook.db

**Before using Aliasing**

In [3]:
%%sql

SELECT customers.FirstName, customers.LastName, employees.FirstName, employees.LastName
FROM customers, employees

WHERE customers.Country = "Canada"
AND customers.SupportRepId = employees.EmployeeId;

 * sqlite:///chinook.db
Done.

[('François', 'Tremblay', 'Jane', 'Peacock'),
 ('Mark', 'Philips', 'Steve', 'Johnson'),
 ('Jennifer', 'Peterson', 'Jane', 'Peacock'),
 ('Robert', 'Brown', 'Jane', 'Peacock'),
 ('Edward', 'Francis', 'Jane', 'Peacock'),
 ('Martha', 'Silk', 'Steve', 'Johnson'),
 ('Aaron', 'Mitchell', 'Margaret', 'Park'),
 ('Ellie', 'Sullivan', 'Jane', 'Peacock')]

**using Aliasing**

In [5]:
%%sql

SELECT c.FirstName AS "customer_name", c.LastName AS "customer_surname", e.FirstName AS  "agent_name", e.LastName AS "agent_surname"
FROM customers c, employees e

WHERE c.Country = "Canada"
AND c.SupportRepId = e.EmployeeId;

 * sqlite:///chinook.db
Done.

[('François', 'Tremblay', 'Jane', 'Peacock'),
 ('Mark', 'Philips', 'Steve', 'Johnson'),
 ('Jennifer', 'Peterson', 'Jane', 'Peacock'),
 ('Robert', 'Brown', 'Jane', 'Peacock'),
 ('Edward', 'Francis', 'Jane', 'Peacock'),
 ('Martha', 'Silk', 'Steve', 'Johnson'),
 ('Aaron', 'Mitchell', 'Margaret', 'Park'),
 ('Ellie', 'Sullivan', 'Jane', 'Peacock')]